app/views/users/show.html.erb

SELECT  "users".* FROM "users"  WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
---

<%= User.find(@id).fname %>