app/controllers/users_controller.rb

SELECT "users".* FROM "users"
---
	def index
		# @ is an instance variable, we do this to pass it to the controller
		@users = User.all

SELECT  "users".* FROM "users"  WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
---
	def show
		@id = params[:id]
		@user = User.find(@id)